package practice;

public class PrEx12 {

	public static void main(String[] args) {
		
		//문제 7. 주문 프로그램 - 무한반복

				/*
				 ***글로벌 카페 메뉴 ***
				 1. 아메리카노	:2500원
				 2. 카페라떼	:3000원
				 3. 카푸치노	3000원
				 4. 카라멜프라푸치노	:4000원
				 5. 햄치즈샌드위치	:6000원
				 6. 종료
				 
				 1단계 : 위 메뉴를 콘솔에 출력하고, 종료(6번)를 선택할때까지 반복해서 메뉴 번호로 주문을 받고, 
				 		종료 선택후 총 주문 금액 출력
				 2단계 : int money = 20000; 내 돈에서 주문시주문금액 차감, 돈이 부족하면 주문 추가 불가, 
				 		종료시 총액 출력, 잔액도 출력	 */
		
		
		
		
		//문제 8. -1이 입력될대까지 정수를 계속 입력받아, -1 입력시 총합과 평균을 출력하는 프로그램
		
		
		
		
		//문제 9. 문자열을 계속 입력받고 출력하되, "exit"를 입력받으면 종료되는 프로그램 
				//*힌트 문자열 비교는 == 불가, String의 기능중 equals()사용
				// String str = "abc";
				// System.out.println(str.equals("abc")); => true 출력
		
		
	}

}
